SpenceKonde/ATTinyCore/avr/libraries/Servo_ATTinyCore/src/avr/Servo_ATTinyCore.cpp
//=============================================================================
// FUNCTION:    void enableDisableServo(uint8_t servoNumber, bool servoShouldBeEnabled)
//
// DESCRIPTION: Enabled or disables an allocated servo slot.
//              An enabled slot generates a pwm wave on its pin.
//              A disabled slot does not.
//
// INPUT:       servoNumber - which servo slot to update
//              servoShouldBeEnabled - true to enable the servo slot
//                                     false to disable the servo slot
//
// RETURNS:     Nothing
//
//=============================================================================
void ServoSequencer::enableDisableServo(uint8_t servoNumber, bool servoShouldBeEnabled)
{

    //make sure we got a valid slot number and the slot is registered to a servo
    if( (servoNumber < MAX_SERVOS      ) &&
        (servoRegistry[servoNumber].slotOccupied == true)   )
    {
        if(servoShouldBeEnabled == true)
        {

            //if this is the very first servo we are enabling then configure the servo timer
            if( timerIsSetup == false)
            {
                servoTimerSetup();
                timerIsSetup = true;
            }

            else
            {
                //The timer is already setup. Do nothing.
                //It needs to be setup only once. We do it when the first servo is enabled.
                //We setup the timer as late as possible. This allows this servo library
                //to be more compatible with various frameworks written for the attiny45/85,
                //which typically configure all the timers to their liking on start up.
                //Configuring our timer late allows us to overwrite these settings.
            }
            //enable the servo. Its pulse will now be output on its pin.
            servoRegistry[servoNumber].enabled = true;
        }
        else
        {
            //disable the servo. Its pulse will cease to be generated.
            servoRegistry[servoNumber].enabled = false;
            //TODO: set this servo pin low, if it is high.
            //      Actually, ideally the pulse should finish by itself
            //      forcing the pin low will generate a weird length pulse for the servo
            //      Need to add some sort of "disable pending" status
        }
    }
    else
    {
        //Servo number is out of range or is not allocate to a servo. Do nothing.
    }
}//end enableDisableServo



//=============================================================================
// FUNCTION:    bool isEnabled(uint8_t servoNumber)
//
// DESCRIPTION: Determines if a servo slot is enabled.
//
// INPUT:       servoNumber - which servo slot to check
//
// RETURNS:     true if the slot is enabled
//              false if it is disabled or not allocated to a servo.
//
//=============================================================================
bool ServoSequencer::isEnabled(uint8_t servoNumber)
{
    //make sure we got a valid slot number and the slot is registered to a servo
    if( (servoNumber < MAX_SERVOS      ) &&
        (servoRegistry[servoNumber].slotOccupied == true)   )
    {
        return servoRegistry[servoNumber].enabled;
    }
    else
    {
        //Servo number is out of range or is not allocate to a servo.
        //So therefore it is not enabled.
        return false;
    }
}//end isEnabled


//=============================================================================
// FUNCTION:    void servoTimerSetup()
//
// DESCRIPTION: Sets up the timer used by this servo driver
//              No servo pulses can be generated until this function is called.
//
// INPUT:       Nothing
//
// RETURNS:     Nothing
//
//=============================================================================
void ServoSequencer::servoTimerSetup()
{
    //set up the timer prescaler based on which timer was selected and our F_CPU clock
    setupTimerPrescaler();
    #ifdef __AVR_ATtinyX61__
    TCCR1A=0;
    #endif
    // Enable Output Compare Match Interrupt
    TIMSK |= (1 << OCIEnx);

    //reset the counter to 0
    TCNTn  = 0;
    //set the compare value to any number larger than 0
    OCRnx = 255;
    // Enable global interrupts
    sei();

    /*
    TCNT0 - The Timer/Counter
    OCR0A and OCR0B - Output Compare Registers
    TIFR0 - Timer Interrupt Flag Register
    TIMSK - Timer Interrupt Mask Register
    TCCR0B Timer/Counter Control Register B
    */

}//end servoTimerSetup


//=============================================================================
// FUNCTION:    void setupTimerPrescaler()
//
// DESCRIPTION: Helper function that sets up the timer prescaller based on what
//              timer is selected and the F_CPU frequence.
//
// INPUT:       Nothing
//
// RETURNS:     Nothing
//
//=============================================================================
void ServoSequencer::setupTimerPrescaler()
{
    #ifdef PLLTIMER1
        #error "PLL Timer source not compatible with Servo, turn it off."
    #endif
    #ifdef LOWPLLTIMER1
        #error "PLL Timer source not compatible with Servo, turn it off."
    #endif
    //reset the Timer Counter Control Register to its reset value
  #if defined(__AVR_ATtinyX5__)
    TCCR1 = 0;

    #if F_CPU == 8000000L
        //set counter1 prescaler to 64
        //our F_CPU is 8mhz so this makes each timer tick be 8 microseconds long
        //TCCR1 &= ~(1<< CS13); //clear
        //TCCR1 |=  (1<< CS12); //set
        //TCCR1 |=  (1<< CS11); //set
        //TCCR1 |=  (1<< CS10); //set
        TCCR1=7;
    #elif F_CPU == 16000000L //16MHz
        //TCCR1|=(1<<CS13)
        TCCR1=8;

    #elif F_CPU == 1000000L
        //set counter1 prescaler to 8
        //our F_CPU is 1mhz so this makes each timer tick be 8 microseconds long
        //TCCR1 &= ~(1<< CS13); //clear
        //TCCR1 |=  (1<< CS12); //set
        //TCCR1 &= ~(1<< CS11); //clear
        //TCCR1 &= ~(1<< CS10); //clear
        TCCR1=4;
    #else
        #error "Servo only supported at 1MHz, 8MHz and 16MHz on tiny25/45/85. "
    #endif
  #elif defined(__AVR_ATtinyX61__)
    TCCR1B = 0;

    #if F_CPU == 8000000L
        //set counter1 prescaler to 64
        //our F_CPU is 8mhz so this makes each timer tick be 8 microseconds long
        //TCCR1 &= ~(1<< CS13); //clear
        //TCCR1 |=  (1<< CS12); //set
        //TCCR1 |=  (1<< CS11); //set
        //TCCR1 |=  (1<< CS10); //set
        TCCR1B=7;
    #elif F_CPU == 16000000L //16MHz
        //TCCR1|=(1<<CS13)
        TCCR1B=8;

    #elif F_CPU == 1000000L
        //set counter1 prescaler to 8
        //our F_CPU is 1mhz so this makes each timer tick be 8 microseconds long
        //TCCR1 &= ~(1<< CS13); //clear
        //TCCR1 |=  (1<< CS12); //set
        //TCCR1 &= ~(1<< CS11); //clear
        //TCCR1 &= ~(1<< CS10); //clear
        TCCR1B=4;
    #else
        #error "Servo only supported at 1MHz, 8MHz and 16MHz on tiny261/461/861. "
    #endif

  #endif
}//end setupTimerPrescaler


